import datetime
import textwrap

columns = ['qid', 'qlastpage', 'q1_attendslectures', 'q2_coursehaslabs', 'q2b_attendslabs',
           'q3_cleargoalslectures', 'q4_cleargoalslabs', 'q5_studymaterial',
           'q6_tutorinteresting',
           'q7_tutorquestions', 'q8_tutorreachable', 'q9_tutorexplains',
           'q10_tutorontime', 'q11_hasassistant', 'q11b_assistanthelps',
           'q12_materialcovered',
           'q13_tutororganised', 'q14_evaluationcriteria', 'opencomments', 'courseid',
           'qyear', 'qseason']
mean_columns = ['q3_cleargoalslectures', 'q4_cleargoalslabs', 'q5_studymaterial',
                'q6_tutorinteresting',
                'q7_tutorquestions', 'q8_tutorreachable', 'q9_tutorexplains',
                'q10_tutorontime', 'q11b_assistanthelps',
                'q12_materialcovered',
                'q13_tutororganised', 'q14_evaluationcriteria']
dict_mean_columns = [("q3_cleargoalslectures",
                      "Ο/η διδάσκων/ουσα σας γνωστοποιεί με σαφήνεια, από την αρχή του εξαμήνου, τους στόχους και το περιεχόμενο του μαθήματος;"),
                     ("q4_cleargoalslabs",
                      "Το εργαστήριο συμβάλλει αποτελεσματικά στην ουσιαστική κατανόηση του αντικειμένου του μαθήματος;"),
                     ("q5_studymaterial",
                      "Το εκπαιδευτικό υλικό που χρησιμοποιείται (σύγγραμμα, σημειώσεις, πρόσθετη βιβλιογραφία) συμβάλλει στην καλύτερη κατανόηση του μαθήματος;"),
                     ("q6_tutorinteresting",
                      "Ο/η διδάσκων/ουσα επιτυγχάνει να διεγείρει το ενδιαφέρον σας για το αντικείμενο του μαθήματος;"),
                     ("q7_tutorquestions",
                      "Ο/η διδάσκων/ουσα σας ενθαρρύνει να διατυπώνετε απορίες και ερωτήσεις κατά τη διάρκεια του μαθήματος;"),
                     ("q8_tutorreachable",
                      "Ο/η διδάσκων/ουσα είναι εύκολα προσβάσιμος και εκτός των ωρών της διάλεξης;"),
                     ("q9_tutorexplains",
                      "Ο/η διδάσκων/ουσα σας γνωστοποιεί, από την αρχή του εξαμήνου, τον τρόπο και τα κριτήρια αξιολόγησής σας;"),
                     ("q10_tutorontime",
                      "Ο/η διδάσκων/ουσα είναι συνεπής στις υποχρεώσεις του (παρουσία στα μαθήματα, έγκαιρη διόρθωση εργασιών/ασκήσεων, ώρες συνεργασίας με τους φοιτητές);"),
                     ("q11b_assistanthelps",
                      "Το επικουρικό διδακτικό προσωπικό συμβάλλει στην καλύτερη κατανόηση της ύλης;"),
                     ("q12_materialcovered",
                      "Το μάθημα συμβάλλει αποτελεσματικά στην ουσιαστική κατανόηση του αντικειμένου και την ανάπτυξη του προβληματισμού σας;"),
                     ("q13_tutororganised", "Ο/η διδάσκων/ουσα παρουσιάζει οργανωμένα το μάθημα;"),
                     ("q14_evaluationcriteria",
                      "Κατά πόσο τα κριτήρια που χρησιμοποιήθηκαν για την αξιολόγηση είναι αποτελεσματικά;")]
dict_columns = [('qid', ''),
                ('qlastpage', ''),
                ('q1_attendslectures', 'Παρακολουθείτε τις διαλέξεις του μαθήματος;'),
                ('q2_coursehaslabs', 'Το μάθημα έχει εργαστήριο;'),
                ('q2b_attendslabs', 'Παρακολουθείτε τα εργαστήρια του μαθήματος;'),
                ('q3_cleargoalslectures',
                 'Ο/η διδάσκων/ουσα σας γνωστοποιεί με σαφήνεια, από την αρχή του εξαμήνου, τους στόχους και το περιεχόμενο του μαθήματος;'),
                ('q4_cleargoalslabs',
                 'Το εργαστήριο συμβάλλει αποτελεσματικά στην ουσιαστική κατανόηση του αντικειμένου του μαθήματος; '),
                ('q5_studymaterial',
                 'Το εκπαιδευτικό υλικό που χρησιμοποιείται (σύγγραμμα, σημειώσεις, πρόσθετη βιβλιογραφία) συμβάλλει στην καλύτερη κατανόηση του μαθήματος;'),
                ('q6_tutorinteresting',
                 'Ο/η διδάσκων/ουσα επιτυγχάνει να διεγείρει το ενδιαφέρον σας για το αντικείμενο του μαθήματος;'),
                ('q7_tutorquestions',
                 'Ο/η διδάσκων/ουσα σας ενθαρρύνει να διατυπώνετε απορίες και ερωτήσεις κατά τη διάρκεια του μαθήματος;'),
                ('q8_tutorreachable', 'Ο/η διδάσκων/ουσα είναι εύκολα προσβάσιμος και εκτός των ωρών της διάλεξης;'),
                # Το λεκτικό το έφτιαξα εγώ
                ('q9_tutorexplains',
                 'Ο/η διδάσκων/ουσα σας γνωστοποιεί, από την αρχή του εξαμήνου, τον τρόπο και τα κριτήρια αξιολόγησής σας;'),
                ('q10_tutorontime',
                 'Ο/η διδάσκων/ουσα είναι συνεπής στις υποχρεώσεις του (παρουσία στα μαθήματα, έγκαιρη διόρθωση εργασιών/ασκήσεων, ώρες συνεργασίας με τους φοιτητές);'),
                ('q11_hasassistant', 'Το μάθημα έχει επικουρικό διδακτικό προσωπικό;'),
                (
                    'q11b_assistanthelps',
                    'Το επικουρικό διδακτικό προσωπικό συμβάλλει στην καλύτερη κατανόηση της ύλης;'),
                ('q12_materialcovered',
                 'Το μάθημα συμβάλλει αποτελεσματικά στην ουσιαστική κατανόηση του αντικειμένου και την ανάπτυξη του προβληματισμού σας;'),
                ('q13_tutororganised', 'Ο/η διδάσκων/ουσα παρουσιάζει οργανωμένα το μάθημα;'),
                ('q14_evaluationcriteria',
                 'Κατά πόσο τα κριτήρια που χρησιμοποιήθηκαν για την αξιολόγηση είναι αποτελεσματικά;'),
                # Το λεκτικό το έφτιαξα εγώ
                ('opencomments', 'Ενδεχόμενες παρατηρήσεις και σχόλια'),
                ('courseid', ''),
                ('qyear', ''),
                ('qseason', ''),
                # Extra questions
                ('extra1', 'Το μάθημα είναι μάθημα επιλογής;'),
                ('extra2', 'Για ποιους λόγους επιλέξατε το μάθημα;'),
                (
                    'extra3',
                    'Το υλικό που διαθέτει ο/η διδάσκων/ουσα ΗΡΑΚΛΗΣ  ΒΑΡΛΑΜΗΣ στο e-class είναι ικανοποιητικό;'),
                ('extra4',
                 'Ο/η διδάσκων/ουσα ΧΡΗΣΤΟΣ ΣΑΡΔΙΑΝΟΣ σας γνωστοποιεί με σαφήνεια, από την αρχή του εξαμήνου, τους στόχους και το περιεχόμενο του μαθήματος;'),
                ('extra5',
                 'Ο/η διδάσκων/ουσα ΧΡΗΣΤΟΣ ΣΑΡΔΙΑΝΟΣ σας γνωστοποιεί, από την αρχή του εξαμήνου, τον τρόπο και τα κριτήρια αξιολόγησής σας; '),
                ('extra6', 'Ο/η διδάσκων/ουσα ΧΡΗΣΤΟΣ ΣΑΡΔΙΑΝΟΣ παρουσιάζει οργανωμένα το μάθημα;'),
                ('extra7',
                 'Ο/η διδάσκων/ουσα ΧΡΗΣΤΟΣ ΣΑΡΔΙΑΝΟΣ επιτυγχάνει να διεγείρει το ενδιαφέρον σας για το αντικείμενο του μαθήματος; '),
                ('extra8',
                 'Ο/η διδάσκων/ουσα ΧΡΗΣΤΟΣ ΣΑΡΔΙΑΝΟΣ σας ενθαρρύνει να διατυπώνετε απορίες και ερωτήσεις κατά τη διάρκεια του μαθήματος;'),
                ('extra9',
                 'Ο/η διδάσκων/ουσα ΧΡΗΣΤΟΣ ΣΑΡΔΙΑΝΟΣ είναι συνεπής στις υποχρεώσεις του (παρουσία στα μαθήματα, έγκαιρη διόρθωση εργασιών/ασκήσεων, ώρες συνεργασίας με τους φοιτητές);'),
                ('extra10',
                 'Το εκπαιδευτικό υλικό που χρησιμοποιείται (σύγγραμμα, σημειώσεις, πρόσθετη βιβλιογραφία) συμβάλλει στην καλύτερη κατανόηση του μαθήματος;'),
                ('extra11',
                 'Το υλικό που διαθέτει ο/η διδάσκων/ουσα ΧΡΗΣΤΟΣ ΣΑΡΔΙΑΝΟΣ στο e-class είναι ικανοποιητικό; '),
                # Tele
                ('tele1',
                 'Το μάθημα παρέχεται με μεθόδους ασύγχρονης ή/και σύγχρονης εκπαίδευσης (ανάρτηση εκπαιδευτικού υλικού σε ηλεκτρονική πλατφόρμα, διαδικτυακή διεξαγωγή μαθήματος, βιντεοσκοπημένες διαλέξεις); *'),
                ('tele2', 'Η εξ’ αποστάσεως διενέργεια των μαθημάτων σας  δημιουργεί προβλήματα λόγω:'),
                ('tele3',
                 'Η εξ’ αποστάσεως εκπαίδευση συμβάλλει αποτελεσματικά στην κατανόηση της διδακτέας ύλης του μαθήματος στο τρέχον ακαδημαϊκό εξάμηνο;'),
                ('tele4',
                 'Οι διδάσκοντες/ουσες έχουν προσαρμόσει ικανοποιητικά τις διαλέξεις τους στις νέες απαιτήσεις της εξ’ αποστάσεως εκπαίδευσης; '),
                ('tele5', 'Οι διαλέξεις καταγράφονται και έχετε πρόσβαση σε αυτές;'),
                ('tele6', 'Σε ποιο βαθμό παρακολουθείτε τις online/βιντεοσκοπημένες διαλέξεις;')
                ]


# Iterate titles based on the id so the plots can load them from the config
# That way, any change can come once through here and not a lot of times in the code
def titles(lesson_id):
    for i, y in dict_columns:
        if i == lesson_id:
            return '<br>'.join(textwrap.wrap(y))


# Labels for the bar charts
bar_labels = {"value": "Βαθμολογία", "count": "Καταμέτρηση"}

mean_columns_plus_year = ['q3_cleargoalslectures', 'q4_cleargoalslabs', 'q5_studymaterial',
                          'q6_tutorinteresting',
                          'q7_tutorquestions', 'q8_tutorreachable', 'q9_tutorexplains',
                          'q10_tutorontime', 'q11b_assistanthelps',
                          'q12_materialcovered',
                          'q13_tutororganised', 'q14_evaluationcriteria', 'qyear']
year = int((datetime.datetime.now().strftime('%Y')))

height = 500
width = 700
bar_x_range = [0, 6]
